app/controllers/ingredients_controller.rb

SELECT * FROM "ingredients"
---
  def index
    @ingredients = Ingredient.all