app/controllers/recipes_controller.rb

  def show
    @recipe = Recipe.find(params[:id])

	current_page = params[:page]
	per_page = params[:per_page]
    reviews = @recipe.reviews
	@reviews = Review.paginate :page =>params[:page], :per_page => 5, :order => 'created_at DESC', :conditions => {:recipe_id => @recipe.id}
---
SELECT * FROM "reviews" WHERE ("reviews".recipe_id = 1)