app/controllers/recipes_controller.rb

SELECT * FROM "recipes"
INSERT INTO "recipe_lists" ("created_at", "updated_at", "user_id") VALUES('2010-11-23 03:00:35', '2010-11-23 03:00:35', NULL)
INSERT INTO "recipes" ("directions", "created_at", "title", "updated_at", "recipelist_id", "completion_time") VALUES('Cook', '2010-11-23 03:00:35', 'Chicken', '2010-11-23 03:00:35', NULL, 5)
---
  def index
    @recipes = Recipe.all
	first_recipelist = RecipeList.create

INSERT INTO "recipes" ("directions", "created_at", "title", "updated_at", "recipelist_id", "completion_time") VALUES('Warm it up.', '2010-10-29 00:09:47', 'Chef Boyardee', '2010-10-29 00:09:47', 0, 2)
---
  def create
    @recipe = Recipe.new(params[:recipe])

    respond_to do |format|
      if @recipe.save

SELECT * FROM "recipes" WHERE ("recipes"."title" = 'chef boyardee')
---
  def search

	@results = Recipe.find(:all, :conditions => {:title => params[:input]})