app/controllers/reviews_controller.rb

  def index
    @reviews = Review.all
---
SELECT * FROM "reviews"

  def show
    @review = Review.find(params[:id])
---
SELECT * FROM "reviews" WHERE ("reviews"."id" = 1)

  def create
    @review = Review.new(params[:review])

    respond_to do |format|
      if @review.save
---
INSERT INTO "reviews" ("rating", "created_at", "title", "recipe_id", "updated_at", "review") VALUES(5, '2010-11-16 16:34:12', 'Cool', 1, '2010-11-16 16:34:12', 'Sick')

  def destroy
    @review = Review.find(params[:id])
    @review.destroy
---
SELECT * FROM "reviews" WHERE ("reviews"."id" = 2)
DELETE FROM "reviews" WHERE "id" = 2