app/controllers/users_controller.rb

INSERT INTO "recipe_lists" ("created_at", "updated_at", "user_id") VALUES('2010-11-16 16:34:14', '2010-11-16 16:34:14', NULL)
---
  def create
    @user = User.new(params[:user])
	recipe_list = RecipeList.create